# goal: 자연수 n이 매개변수로 주어질 때, n을 124 나라에서 사용하는 숫자로 바꾼 값을 return 하도록
# solution 함수를 완성해 주세요.

# 제한사항
#   n은 500,000,000이하의 자연수 입니다.


# 1 - 1     1       1       1         [1*, 2, 4]
# 2 - 10    10      2       2         [1, 2*, 4]
# 3 - 11    100     10      4         [1, 2, 4*]
# 4 - 100   1011    11      11        [1**, 2, 4]
# 5 - 101   1100    12      12        [1*, 2*, 4]
# 6 - 110   1100    20      14        [1, 2, 4]
# 7 - 111   1100    21      14        [1, 2, 4]

def solution(n):
    answer = ''
    return answer