# goal:아이언 슈트 구매자가 이동하려는 거리 N이 주어졌을 때, 사용해야 하는 건전지 사용량의 최솟값을
# return하는 solution 함수를 만들어 주세요

# - (현재까지 온 거리) x 2 에 해당하는 위치로 순간이동을 할 수 있다
# - 순간이동을 하면 건전지 사용량이 줄지 않다
# - 앞으로 K 칸을 점프하면 K 만큼의 건전지 사용량이 듭니다

# 제한 사항
#   - 숫자 N: 1 이상 10억 이하의 자연수
#   - 숫자 K: 1 이상의 자연수

# example
#   n: 5
#   current position          final Position
                    #      0  1  2  3  4  5
                    # 0    0  1  2  3  4  5
                    # 1    -  0  0  1  0  1
                    # 2    -  -  0  1  0  1
                    # 3    -  -  -  0  1  2
                    # 4    -  -  -  -  0  1
                    # 5    -  -  -  -  -  0

# 0 1 2 3 4 5
# 0 1 1 2 1 2

# 0 1 2 3 4 5 6
# 0 1 1 2 1 2 2

# 0 1 2 3 4 5 6 7 it's a dynamic programming!!!
# 0 1 1 2 1 2 2 3

# Detailed Example
# n =7
# dp = [0,0,0,0,0,0,0,0]
# dp = [0,0,0,0,0,0,0,0] 1 is odd --> dp[1] = dp[1 // 2] + 1 = 1
# dp = [0,1,0,0,0,0,0,0] 2 is even --> dp[2] = dp[2 // 2] = 1
# dp = [0,1,1,0,0,0,0,0] 3 is odd --> dp[3] = dp[3 // 2] + 1 = 2
# dp = [0,1,1,2,0,0,0,0] 4 is even --> dp[4] = dp[4 // 2] = 1
# dp = [0,1,1,2,1,0,0,0] 5 is odd --> dp[5] = dp[5 // 2] + 1 = 2
# dp = [0,1,1,2,0,0,0,0] 6 is even --> dp[6] = dp[6 // 2] = 2
# dp = [0,1,1,2,0,0,0,0] 7 is odd --> dp[7] = dp[7 // 2] + 1 = 3


def solution(n):
    ans = 0

    # [실행] 버튼을 누르면 출력 값을 볼 수 있습니다.
    print('Hello Python')

    #

    return ans